In [16]:
import numpy as np
import pandas as pd

In [13]:
dict1={'names':['Ramesh','suresh',np.nan,'mahesh'],
      'Age':[31,32,33,np.nan],
      'city':[np.nan,'Hyd','Mumbai','chennai']}

In [22]:
data1=pd.DataFrame(dict1)
data1

    names   Age     city
0  Ramesh  31.0      NaN
1  suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  mahesh   NaN  chennai

In [23]:
data1=pd.DataFrame(dict1)

In [18]:
data1.isnull().sum()

names    1
Age      1
city     1
dtype: int64

In [20]:
data1.isnull().sum()/len(data1)

names    0.25
Age      0.25
city     0.25
dtype: float64

In [21]:
data1.isnull().sum()*100/len(data1)

names    25.0
Age      25.0
city     25.0
dtype: float64

In [25]:
dict2={'names':['Ramesh','suresh',np.nan,'mahesh'],
      'Age':[31,32,33,np.nan],
      'city':[np.nan,'Hyd','Mumbai','chennai']}

data2=pd.DataFrame(dict2)
data2

    names   Age     city
0  Ramesh  31.0      NaN
1  suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  mahesh   NaN  chennai

In [26]:
data2.isnull()

   names    Age   city
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [27]:
data2.isnull().sum()

names    1
Age      1
city     1
dtype: int64

In [28]:
dict3={'names':['Ramesh','suresh','null','mahesh'],
      'Age':[31,32,33,'null'],
      'city':[np.nan,'Hyd','Mumbai','chennai']}

data3=pd.DataFrame(dict3)
data3

    names   Age     city
0  Ramesh    31      NaN
1  suresh    32      Hyd
2    null    33   Mumbai
3  mahesh  null  chennai

In [29]:
data3.isnull().sum()

names    0
Age      0
city     1
dtype: int64

In [30]:
data3.isnull()

   names    Age   city
0  False  False   True
1  False  False  False
2  False  False  False
3  False  False  False

** method-1**
>fill the missing values with random number

In [31]:
data1.fillna(40)

    names   Age     city
0  Ramesh  31.0       40
1  suresh  32.0      Hyd
2      40  33.0   Mumbai
3  mahesh  40.0  chennai

** method-1**

fill the missing values with random number on specific columns

In [34]:
data1['names'].fillna('sathish',inplace=True)
data1

     names   Age     city
0   Ramesh  31.0      NaN
1   suresh  32.0      Hyd
2  sathish  33.0   Mumbai
3   mahesh   NaN  chennai

In [35]:
dict1={'names':['Ramesh','suresh',np.nan,'mahesh'],
      'Age':[31,32,33,np.nan],
      'city':[np.nan,'Hyd','Mumbai','chennai']}
data1=pd.DataFrame(dict1)

In [36]:
data1.fillna(method='backfill')

    names   Age     city
0  Ramesh  31.0      Hyd
1  suresh  32.0      Hyd
2  mahesh  33.0   Mumbai
3  mahesh   NaN  chennai

In [38]:
data1.fillna(method='bfill')

    names   Age     city
0  Ramesh  31.0      Hyd
1  suresh  32.0      Hyd
2  mahesh  33.0   Mumbai
3  mahesh   NaN  chennai

In [39]:
data1.fillna(method='ffill')

    names   Age     city
0  Ramesh  31.0      NaN
1  suresh  32.0      Hyd
2  suresh  33.0   Mumbai
3  mahesh  33.0  chennai

data1.fillna(method='pad')

In [40]:
data1.fillna(method='pad')

    names   Age     city
0  Ramesh  31.0      NaN
1  suresh  32.0      Hyd
2  suresh  33.0   Mumbai
3  mahesh  33.0  chennai

## $ mean $

In [42]:
age_mean=data1['Age'].mean()
age_mean

32.0

In [43]:
data1['Age'].fillna(age_mean)

0    31.0
1    32.0
2    33.0
3    32.0
Name: Age, dtype: float64

In [44]:
age_median=data1['Age'].median()
age_median

32.0

In [45]:
data1['Age'].fillna(age_median)

0    31.0
1    32.0
2    33.0
3    32.0
Name: Age, dtype: float64

In [46]:
age_mode=data1['Age'].mode()
age_mode

0    31.0
1    32.0
2    33.0
Name: Age, dtype: float64

In [47]:
data1['Age'].fillna(age_mode)

0    31.0
1    32.0
2    33.0
3     NaN
Name: Age, dtype: float64

$KNN$ $IMPUTER$

In [49]:
#KNN : K NEAREST NEIGHBOURS

In [56]:
from sklearn.impute import KNNImputer
knn=KNNImputer(n_neighbors=2)
knn.fit_transform(data1[['Age']])

array([[31.],
       [32.],
       [33.],
       [32.]])

In [57]:
data1

    names   Age     city
0  Ramesh  31.0      NaN
1  suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  mahesh   NaN  chennai